
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "aac7bc82-ef91-45ef-9f85-b71df3d7659c" -> (known after apply)
        application_type                      = "web"
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
        disable_ip_masking                    = false
        force_customer_storage_for_profiler   = false
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.Insights/components/rse-appinsights-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        internet_ingestion_enabled            = true
        internet_query_enabled                = true
        local_authentication_disabled         = false
        location                              = "westeurope"
        name                                  = "rse-appinsights-aat"
        resource_group_name                   = "rse-aat"
        retention_in_days                     = 90
        sampling_percentage                   = 100
        tags                                  = {
            "BuiltFrom"           = "https://github.com/HMCTS/rse-dashboard-github-ingestion.git"
            "application"         = "core"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "Reform Software Engineering"
        }
      - workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourcegroups/defaultresourcegroup-suk/providers/microsoft.operationalinsights/workspaces/defaultworkspace-1c4f0704-a29e-403d-b719-b90c34ef14c9-suk" -> null
    }

  # azurerm_key_vault_secret.AZURE_APPINSIGHTS_KEY will be updated in-place
  ~ resource "azurerm_key_vault_secret" "AZURE_APPINSIGHTS_KEY" {
        id                      = "https://rse-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/2e06020f439f4519b62c6cfb5acd3cbc"
        key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat"
        name                    = "AppInsightsInstrumentationKey"
        resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat/secrets/AppInsightsInstrumentationKey/versions/2e06020f439f4519b62c6cfb5acd3cbc"
        resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat/secrets/AppInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        version                 = "2e06020f439f4519b62c6cfb5acd3cbc"
        versionless_id          = "https://rse-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey"
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "developer" {
      ~ certificate_permissions = [
          + "Get",
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          - "GetIssuers",
          - "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
        ]
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ key_permissions         = [
          + "Get",
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
        ]
        key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat"
        object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ secret_permissions      = [
          + "Get",
            "List",
          - "Set",
          - "Delete",
        ]
        storage_permissions     = []
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat|rse-aat"
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        name                       = "rse-aat"
        target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rse-aat/providers/Microsoft.KeyVault/vaults/rse-aat"

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":6,"Program":"tfcmt","SHA1":"","Vars":{}} -->